# 第4章 基本数据管理

## 4.1 Demo

In [39]:
# 创建leadership数据框
manager <- c(1,2,3,4,5)
date <- c("10/24/08","10/28/08","10/1/08","10/12/08","5/1/09")
gender <- c("M","F","F","M","F")
age <- c(32,45,25,39,99)
q1 <- c(5,3,3,3,2)
q2 <- c(4,5,5,3,2)
q3 <- c(5,2,5,4,1)
q4 <- c(5,5,5,NA,2)
q5 <- c(5,5,2,NA,1)
leadership <- data.frame(manager,date,gender,age,q1,q2,q3,q4,q5, 
                         stringsAsFactors=FALSE) # 创建dataframe，由于有字符串，需要不认成factors

In [7]:
leadership

  manager date     gender age q1 q2 q3 q4 q5
1 1       10/24/08 M      32  5  4  5   5  5
2 2       10/28/08 F      45  3  5  2   5  5
3 3       10/1/08  F      25  3  5  5   5  2
4 4       10/12/08 M      39  3  3  4  NA NA
5 5       5/1/09   F      99  2  2  1   2  1

## 创建新变量

In [11]:
mydata <- data.frame(x1=c(2,2,6,4),
                    x2=c(3,4,2,8))
mydata <- transform(mydata, sumx= x1+x2, meanx = (x1+x2)/2)
mydata

  x1 x2 sumx meanx
1 2  3   5   2.5
2 2  4   6   3.0
3 6  2   8   4.0
4 4  8  12   6.0

## 变量的重编码

In [16]:
leadership <- within(leadership, { # within类似with，在leadership空间下。但是可以修改修改数据库
    agecat[age == 99] <- NA # 书上代码有问题
    agecat[age > 75 & age<99] <- 'Elder' # 长者
    agecat[age >= 55 & age <= 75] <- 'Middle Aged'
    agecat[age < 55] <- 'Too young'
})
leadership

  manager date     gender age q1 q2 q3 q4 q5 agecat
1 1       10/24/08 M      32  5  4  5   5  5 Too young
2 2       10/28/08 F      45  3  5  2   5  5 Too young
3 3       10/1/08  F      25  3  5  5   5  2 Too young
4 4       10/12/08 M      39  3  3  4  NA NA Too young
5 5       5/1/09   F      99  2  2  1   2  1 NA

## 变量的重命名

In [20]:
# fix(leadership) # 调出框来调，交互性不错！

#下面使用reshape
# install.packages('reshape') # 首先要安装
library(reshape) # 加载
leadership <- rename(leadership, c(manager='managerID', date='testdate'))
# leadership

In [24]:
# 下面使用 names
names(leadership)[5:9] <- c('item1', 'item2', 'item3', 'item4', 'item5')
leadership

  manager date     gender age item1 item2 item3 item4 item5
1 1       10/24/08 M      32  5     4     5      5     5
2 2       10/28/08 F      45  3     5     2      5     5
3 3       10/1/08  F      25  3     5     5      5     2
4 4       10/12/08 M      39  3     3     4     NA    NA
5 5       5/1/09   F      99  2     2     1      2     1

## 缺失值

In [30]:
y <- c(1,2,3,NA)
is.na(y)

[1] FALSE FALSE FALSE  TRUE

In [32]:
is.na(leadership[,5:9])

     item1 item2 item3 item4 item5
[1,] FALSE FALSE FALSE FALSE FALSE
[2,] FALSE FALSE FALSE FALSE FALSE
[3,] FALSE FALSE FALSE FALSE FALSE
[4,] FALSE FALSE FALSE  TRUE  TRUE
[5,] FALSE FALSE FALSE FALSE FALSE

In [34]:
# 计算时移出缺失值
x <- c(1,2,NA,3)
y <- sum(x, na.rm=TRUE)
y

[1] 6

In [4]:
leadership
newdata <- na.omit(leadership)
newdata

  manager date     gender age q1 q2 q3 q4 q5
1 1       10/24/08 M      32  5  4  5   5  5
2 2       10/28/08 F      45  3  5  2   5  5
3 3       10/1/08  F      25  3  5  5   5  2
4 4       10/12/08 M      39  3  3  4  NA NA
5 5       5/1/09   F      99  2  2  1   2  1

  manager date     gender age q1 q2 q3 q4 q5
1 1       10/24/08 M      32  5  4  5  5  5
2 2       10/28/08 F      45  3  5  2  5  5
3 3       10/1/08  F      25  3  5  5  5  2
5 5       5/1/09   F      99  2  2  1  2  1

## 日期值

In [20]:
mydates <- as.Date(c('2018-09-05', '1926-08-17')) # 默认为yyyy-mm-dd
mydates
dates <- as.Date(c('01/05/1965', '08/17/1926'), '%m/%d/%Y')
dates

[1] "2018-09-05" "1926-08-17"

[1] "1965-01-05" "1926-08-17"

In [17]:
# 时间戳
Sys.Date()
date()

# 格式化时间
format(Sys.Date(), format='%Y %B %d %A')  # 这特么居然是中文...
format(date(), format='%Y %B %d %A')

[1] "2018-09-05"

[1] "Wed Sep 05 10:02:44 2018"

[1] "2018 九月 05 星期三"

[1] "Wed Sep 05 10:02:44 2018"

In [24]:
# 时间间隔
days <- mydates[1] - mydates[2]
days # 长者活的天数

# 日期转字符型
strDates <- as.character(date())
strDates

Time difference of 33622 days

[1] "Wed Sep 05 10:14:03 2018"

## 类型转换

In [36]:
# 判断用is.，转换用as.
is.vector(seq(10))

[1] TRUE

## 数据排序

In [47]:
# leadership
# newdata <- leadership[order(leadership$age)]
# newdata

attach(leadership)
newdata <- leadership[order(gender, -age)]
newdata
detach(leadership)

The following objects are masked _by_ .GlobalEnv:

    age, date, gender, manager, q1, q2, q3, q4, q5

  q1 date     gender age manager
1 5  10/24/08 M      32  1
2 3  10/28/08 F      45  2
3 3  10/1/08  F      25  3
4 3  10/12/08 M      39  4
5 2  5/1/09   F      99  5

## 数据集的合并

In [ ]:
# 添加列
total <- merge(dataframeA, dataframeB, by='ID') # inner join
# 添加行
total <- rbind(dataframeA, dataframeB) # 必须有相同的变量

## 数据集取子集

In [55]:
newdata <- leadership[, c(5:9)] # 按列序号选取所有行
newdata
newdata <- leadership[, c('q1', 'q2')] # 按列名选取
newdata

# 更方便地创建字符型变量
myvars <- paste('q', 1:5, sep='')
myvars

  q1 q2 q3 q4 q5
1 5  4  5   5  5
2 3  5  2   5  5
3 3  5  5   5  2
4 3  3  4  NA NA
5 2  2  1   2  1

  q1 q2
1 5  4
2 3  5
3 3  5
4 3  3
5 2  2

[1] "q1" "q2" "q3" "q4" "q5"

In [59]:
# 剔除变量
myvars <- names(leadership) %in% c('q3', 'q4') # 通过names选取所有变量，然后用%in%判断是否匹配
myvars
newdata <- leadership[!myvars]# 删除变量q3 q4
newdata

# 已知序号时可以用减号来剔除
newdata <- leadership[c(-8, -9)]
newdata

# 或者也可以置空
newdata <- leadership
newdata$q3 <- newdata$q4 <- NULL
newdata

[1] FALSE FALSE FALSE FALSE FALSE FALSE  TRUE  TRUE FALSE

  manager date     gender age q1 q2 q5
1 1       10/24/08 M      32  5  4   5
2 2       10/28/08 F      45  3  5   5
3 3       10/1/08  F      25  3  5   2
4 4       10/12/08 M      39  3  3  NA
5 5       5/1/09   F      99  2  2   1

  manager date     gender age q1 q2 q3
1 1       10/24/08 M      32  5  4  5
2 2       10/28/08 F      45  3  5  2
3 3       10/1/08  F      25  3  5  5
4 4       10/12/08 M      39  3  3  4
5 5       5/1/09   F      99  2  2  1

  manager date     gender age q1 q2 q5
1 1       10/24/08 M      32  5  4   5
2 2       10/28/08 F      45  3  5   5
3 3       10/1/08  F      25  3  5   2
4 4       10/12/08 M      39  3  3  NA
5 5       5/1/09   F      99  2  2   1

In [72]:
# 选入观测
newdata <- leadership[1:3,] # 选择1-3行
newdata <- leadership[which(leadership$gender=='M' &
                           leadership$age > 30),] # 年纪大于30的男性
newdata

# 使用subset函数
newdata <- subset(leadership, age>=35 | age < 24, select=c(q1, q2, q3, q4))
newdata

  manager date     gender age q1 q2 q3 q4 q5
1 1       10/24/08 M      32  5  4  5   5  5
4 4       10/12/08 M      39  3  3  4  NA NA

  q1 q2 q3 q4
2 3  5  2   5
4 3  3  4  NA
5 2  2  1   2

In [75]:
# 随机抽样
mysample <- leadership[sample(1:nrow(leadership), 3, replace=FALSE)] # 随机抽取不重复地三列
mysample

  age manager gender
1 32  1       M
2 45  2       F
3 25  3       F
4 39  4       M
5 99  5       F

In [76]:
# 使用sql操作数据框
install.packages('sqldf')

also installing the dependencies 'bit', 'bit64', 'blob', 'memoise', 'gsubfn', 'proto', 'RSQLite', 'chron'

package 'bit' successfully unpacked and MD5 sums checked
package 'bit64' successfully unpacked and MD5 sums checked
package 'blob' successfully unpacked and MD5 sums checked
package 'memoise' successfully unpacked and MD5 sums checked
package 'gsubfn' successfully unpacked and MD5 sums checked
package 'proto' successfully unpacked and MD5 sums checked
package 'RSQLite' successfully unpacked and MD5 sums checked
package 'chron' successfully unpacked and MD5 sums checked
package 'sqldf' successfully unpacked and MD5 sums checked

The downloaded binary packages are in
	C:\Users\lenovo\AppData\Local\Temp\RtmpIbMEQO\downloaded_packages

In [79]:
library(sqldf)
# python也能做到，pandas.read_sql
newdf <- sqldf('select * from mtcars where carb=1 order by mpg', row.names=TRUE)
newdf

               mpg  cyl disp  hp  drat wt    qsec  vs am gear carb
Valiant        18.1 6   225.0 105 2.76 3.460 20.22 1  0  3    1
Hornet 4 Drive 21.4 6   258.0 110 3.08 3.215 19.44 1  0  3    1
Toyota Corona  21.5 4   120.1  97 3.70 2.465 20.01 1  0  3    1
Datsun 710     22.8 4   108.0  93 3.85 2.320 18.61 1  1  4    1
Fiat X1-9      27.3 4    79.0  66 4.08 1.935 18.90 1  1  4    1
Fiat 128       32.4 4    78.7  66 4.08 2.200 19.47 1  1  4    1
Toyota Corolla 33.9 4    71.1  65 4.22 1.835 19.90 1  1  4    1